app/Controllers/Home.php

INSERT INTO `atividade` (`atividade1`, `atividade2`, `atividade3`, `atividade4`, `atividade5`, `atividade6`, `atividade7`, `atividade8`, `atividade10`) VALUES ('CCCCCCCCC', 'CCCCCCCCCCCCCCCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCCCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCCCCC', 'CCCCCCCCCCCCCC', '#include <iostream>\r\nusing namespace std;\r\n\r\nint main() {\r\n    float nota = 6.5;\r\n    if (nota >= 7)\r\n        cout << \"Aprovado\" << endl;\r\n    else\r\n        cout << \"Reprovado\" << endl;\r\n    return 0;\r\n}')
---
        // Verifica se há dados para inserir no banco
        if (!empty($dadosParaInserir)) {
            // Insere os dados no banco de dados em um único registro
            $atividadeModel->insert($dadosParaInserir);

DELETE FROM `atividade`
WHERE `id_atividade` IN ('85')
---
    public function excluirAtividade()
    {
        $log = $this->sessaoall();

        $id = $this->request->getPost('id');

        $atividadeModel = model('AtividadeModel');

        $atividadeModel->delete($id);