app/Models/AtividadeModel.php

SELECT *
FROM `atividade`
---
    public function getAtividade () {
        //$query = $this->db->query ('select * from clientes;');

        //$query = $this->db->table('clientes')->like('nome', 'a')->get();

        $query = $this->db->table('atividade')->get();