app/Models/MaterialModel.php

    public function getMaterial () {

        $query = $this->db->table('material')->get();
---
SELECT *
FROM `material`